In [1]:
import pandas as pd

In [2]:
pop = pd.Series([10,100,1000])
pop

0      10
1     100
2    1000
dtype: int64

In [3]:
pop.values

array([  10,  100, 1000])

In [4]:
pop.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
pop[0]

10

In [6]:
pop = pd.Series([264, 597, 943], index=['Bulkham Hills', 'Blacktown', 'Castle Hill'] )
pop

Bulkham Hills    264
Blacktown        597
Castle Hill      943
dtype: int64

In [7]:
pop['Blacktown'] = 697
pop

Bulkham Hills    264
Blacktown        697
Castle Hill      943
dtype: int64

In [8]:
pop[['Bulkham Hills', 'Castle Hill']]

Bulkham Hills    264
Castle Hill      943
dtype: int64

In [9]:
pop[pop > 700]

Castle Hill    943
dtype: int64

In [10]:
pop * 100

Bulkham Hills    26400
Blacktown        69700
Castle Hill      94300
dtype: int64

In [11]:
pop

Bulkham Hills    264
Blacktown        697
Castle Hill      943
dtype: int64

In [12]:
#Dictionaries in python
sydney = {'Parramatta':500, 'Redfern':800, 'Potts Point':700}
sydney

{'Parramatta': 500, 'Redfern': 800, 'Potts Point': 700}

In [13]:
type(sydney)

dict

In [14]:
#creating a series from dict
syd_pop = pd.Series(sydney)
syd_pop

Parramatta     500
Redfern        800
Potts Point    700
dtype: int64

In [15]:
suburbs = ['Newtown', 'Burwood', 'Parramatta', 'Potts Point', 'Redfern']
new_syd_pop = pd.Series(syd_pop, suburbs)
new_syd_pop

Newtown          NaN
Burwood          NaN
Parramatta     500.0
Potts Point    700.0
Redfern        800.0
dtype: float64

In [16]:
#checking for null values
pd.isnull(new_syd_pop)

Newtown         True
Burwood         True
Parramatta     False
Potts Point    False
Redfern        False
dtype: bool

In [17]:
pd.notnull(new_syd_pop)

Newtown        False
Burwood        False
Parramatta      True
Potts Point     True
Redfern         True
dtype: bool

In [18]:
syd_pop + new_syd_pop

Burwood           NaN
Newtown           NaN
Parramatta     1000.0
Potts Point    1400.0
Redfern        1600.0
dtype: float64

In [19]:
syd_pop * new_syd_pop

Burwood             NaN
Newtown             NaN
Parramatta     250000.0
Potts Point    490000.0
Redfern        640000.0
dtype: float64

In [21]:
new_syd_pop.name = 'Population'
new_syd_pop.index.name = 'States'
new_syd_pop

States
Newtown          NaN
Burwood          NaN
Parramatta     500.0
Potts Point    700.0
Redfern        800.0
Name: Population, dtype: float64

In [24]:
#dataframes
data = {'State':['NSW', 'Victoria','Queensland', 'WA'],
        'Year':['2016', '2016', '2016', '2016'],
        'Population':[1.8,1.5,1,0.5]}

data

{'State': ['NSW', 'Victoria', 'Queensland', 'WA'],
 'Year': ['2016', '2016', '2016', '2016'],
 'Population': [1.8, 1.5, 1, 0.5]}

In [25]:
frame = pd.DataFrame(data)
frame

        State  Year  Population
0         NSW  2016         1.8
1    Victoria  2016         1.5
2  Queensland  2016         1.0
3          WA  2016         0.5

In [26]:
pd.DataFrame(data, columns=['Year', 'State', 'Population'])

   Year       State  Population
0  2016         NSW         1.8
1  2016    Victoria         1.5
2  2016  Queensland         1.0
3  2016          WA         0.5

In [27]:
frame2 = pd.DataFrame(data, columns=['Year', 'State', 'Population', 'debt'])
frame2

   Year       State  Population debt
0  2016         NSW         1.8  NaN
1  2016    Victoria         1.5  NaN
2  2016  Queensland         1.0  NaN
3  2016          WA         0.5  NaN

In [29]:
frame2.debt= [2,3,4,5]
frame2

   Year       State  Population  debt
0  2016         NSW         1.8     2
1  2016    Victoria         1.5     3
2  2016  Queensland         1.0     4
3  2016          WA         0.5     5

In [31]:
frame2.State

0           NSW
1      Victoria
2    Queensland
3            WA
Name: State, dtype: object

In [33]:
frame2['Year']

0    2016
1    2016
2    2016
3    2016
Name: Year, dtype: object